<?php
/**
 * Маппинг типов цен
 */

return [
    // Название → ID
    'names_to_ids' => [
        'МИЦ' => 2,
        'Дилер' => 3,
        'Партнер' => 4,
        'Мин. опт' => 5,
        'Рег. склад' => 6,
        'МИЦ 0%' => 7,
        'Мин. опт 0%' => 8,
        'Дилер 0%' => 9,
        'Партнер 0%' => 10,
        'Рег. склад 0%' => 11,
        'СуперЦена' => 12,
        'СуперЦена 0%' => 13,
        'СуперЦена +20%' => 14,
        'МИЦ Распродажа' => 15,
    ],

    // ID → Название
    'ids_to_names' => [
        1 => 'BASE - Розничная цена',
        2 => 'МИЦ',
        3 => 'Дилер',
        4 => 'Партнер',
        5 => 'Минимальная опт.цена',
        6 => 'Региональный склад',
        7 => 'МИЦ НДС 0%',
        8 => 'Минимальная опт.цена НДС 0%',
        9 => 'Дилер НДС 0%',
        10 => 'Партнер НДС 0%',
        11 => 'Региональный склад НДС 0%',
        12 => 'СуперЦена',
        13 => 'СуперЦена НДС 0%',
        14 => 'СуперЦена + 20%',
        15 => 'МИЦ Распродажа'
    ]
];